<?php
	/*
	-----------------------------------------------------
	ARJANG - Open Source Project
	PHP Codes
	by Javad Haji Amini - http://jentelman.com
	http://jentelman.com/arjang
	November,2013
	-----------------------------------------------------
	*/
	
	class editor
	{
		/*
		-----------------------------------------------------
		زبان
		*فارسی
		-----------------------------------------------------
		*/
		var $project_name = 'ویرایشگر ارژنگ'; //نام پروژه
		var $ie_header = 'واقعن؟!!!'; //عنوان پیغام مرورگر قدیمی
		var $menu_header_tabs = 'ویرایشگر منبع باز ارژنگ'; //عنوان هدر منو
		var $menu_editor_1 = 'تبدیل حروف عربی و اعداد انگلیسی به فارسی'; //نام ادیتور اول
		var $menu_editor_2 = 'حذف یک کلمه خاص از متن'; //نام ادیتور دوم
		var $menu_editor_3 = 'جایگزین کردن یک واژه به جای واژه ای دیگر در متن'; //نام ادیتور سوم	
		var $menu_editor_4 = 'حذف فاصله های اضافی بین پاراگراف ها'; //نام ادیتور چهارم
		var $menu_editor_5 = 'تبدیل زیر نویس فیلم به متن خام'; //نام ادیتور پنجم
		var $menu_about_arjang = 'درباره ی پروژه ارژنگ'; //عنوان صفحه ی درباره
		var $editor_about_1 = 'این ویرایشگر، متن دریافتی را بررسی می کند و در صورت وجود «ی» و «ک» و «ه» عربی و اعداد انگلیسی یا عربی در متن، آن را اصلاح کرده و به فارسی تبدیل می کند.<br>کافیست متن را در کادر زیر وارد کنید و روی دکمه «ویرایش کن» کلیک کنید.'; //توضیحات و راهنمای ادیتور اول
		var $editor_about_2 = 'اگر کلمه یا جمله ای در متنی زیاد تکرار شده و می خواهید آن را به کل از متن بردارید توسط این قسمت می توانید این کار را انجام دهید.<br>کافیست در کادر زیر متن و در کادر پایینش کلمه یا جمله ای که می خواهید حذف شود را وارد کنید و یکی از دو گزینه را طبق راهنمای زیر انتخاب کنید و سپس بر روی دکمه ی «ویرایش کن» کلیک کنید.<br>اگر گزینه ی «حذف کلی عبارت» را انتخاب کنید حتا اگر در کلمه ای عبارتتان مشاهده شود حذف خواهد شد. به عنوان مثال اگر می خواهد کلمه «از» را حذف کنید، این کلمه از ابتدای کلماتی مثل «ازدواج» و یا انتهای کلماتی مثل «دراز» و حتا از لابلای کلماتی مثل «اندازه» نیز حذف می شود.<br>اگر گزینه «حذف فقط همین عبارت از لابلای متن» را انتخاب کنید، تنها همان کلمه در صورت وجود یک فاصله در هر دو طرف عبارت، حذف خواهد شد. به عنوان مثال در جمله ی «دراز از ازدواج ترسید!» با حذف «از» خروجی خواهد شد: «دراز ازدواج ترسید!». توجه کنید که با این گزینه چون در ابتدا یا انتهای جمله، فاصله فقط از یک طرف وجود دارد، کلمه حذف نمی شود.<br>نکته دیگر اینکه اگر می خواهید مثلن کلمه ای مثل «ازدواج» تبدیل به «دواج» شود ولی «دراز» تغییر نکند، می توانید گزینه «حذف کلی عبارت» را انتخاب و در نوشتن عبارت «از»، قبل از عبارت یک فاصله بزارید و بنویسید « از». در این صورت اگر قبل از هر «از» یک فاصله دیده شود حذف می شود و عباراتی که «از» در لابلا یا آخرشان هست حذف نخواهد شد.'; //توضیحات و راهنمای ادیتور دوم
		var $editor_about_3 = 'اگر کلمه یا جمله ای در متنی زیاد تکرار شده و می خواهید به جای آن عبارت دیگری را جایگزین کنید از این قسمت استفاده کنید<br>کافیست در کادر زیر متن و در کادر پایینش کلمه یا جمله ای که می خواهید حذف شود و در کادر سوم کلمه ای که می خواهید جایگزین متن حذفی شود را وارد کنید و یکی از دو گزینه را طبق راهنمای زیر انتخاب کنید و سپس بر روی دکمه ی «ویرایش کن» کلیک کنید.<br>اگر گزینه ی «جایگزینی کلی عبارت» را انتخاب کنید حتا اگر در کلمه ای عبارتتان مشاهده شود حذف و عبارت مورد نظر، جایگزین خواهد شد. به عنوان مثال اگر می خواهد کلمه «از» را با «نه» جایگزین کنید، این کلمه از ابتدای کلماتی مثل «ازدواج» و یا انتهای کلماتی مثل «دراز» و حتا از لابلای کلماتی مثل «اندازه» نیز حذف و به «نه» تبدیل می شود.<br>اگر گزینه «جایگزینی فقط همین عبارت در لابلای متن» را انتخاب کنید، تنها همان کلمه در صورت وجود یک فاصله در هر دو طرف عبارت، جایگزین خواهد شد. به عنوان مثال در جمله ی «دراز از ازدواج ترسید!» با جایگزینی «نه» به جای «از» خروجی خواهد شد: «دراز نه ازدواج ترسید!». توجه کنید که با این گزینه چون در ابتدا یا انتهای جمله، فاصله فقط از یک طرف وجود دارد، اگر کلمه یافت شود جایگزین نمی شود.<br>نکته دیگر اینکه اگر می خواهید مثلن کلمه ای مثل «ازدواج» تبدیل به «نهدواج» شود ولی «دراز» تغییر نکند، می توانید گزینه «جایگزینی کلی عبارت» را انتخاب و در نوشتن عبارت «از»، قبل از عبارت یک فاصله بزارید و بنویسید « از». در این صورت اگر قبل از هر «از» یک فاصله دیده شود جایگزین می شود و عباراتی که «از» در لابلا یا آخرشان هست حذف نخواهد شد.'; //توضیحات و راهنمای ادیتور سوم
		var $editor_about_4 = 'اگر چندین خط متن دارید که از هم بیشتر از 1 خط فاصله دارند، با این ویرایشگر می توانید فاصله ها را حذف و خطوط را به هم متصل سازید.<br>کافیست متن را در کادر زیر وارد کنید و با توجه به فاصله ای که بین هر خط می خواهید برقرار شود گزینه ای را انتخاب و روی دکمه «ویرایش کن» کلیک کنید.'; //توضیحات و راهنمای ادیتور چهارم
		var $editor_about_5 = 'گاهی اوقات برای بررسی یا خواندن دیالوگ های یک فیلم دوست دارید از زیرنویس پرینت بگیرید و آن را مطالعه کنید. مشکلی که زیر نویس ها دارند این است که علاوه بر دیالوگ ها، قبل از هر دیالوگ شماره و تایم نمایش دیالوگ وجود دارد که برای صرفه جویی در مصرف کاغذ هنگام پرینت مجبورید پاکشان کنید.<br>اگر دیالوگ ها زیاد باشند و دانه دانه بخواهید آن ها را پاک کنید زمان و انرژی زیادی صرف می شود! ولی با این ویرایشگر خیلی سریع می توانید متن خام زیرنویس را تحویل بگیرید.<br>فقط باید زیر نویس را داخل یک برنامه ی متنی مثل notepad باز کنید و متن را کپی کنید و در کادر زیر وارد کنید و روی دکمه ی «ویرایش کن» کلیک کنید.'; //توضیحات و راهنمای ادیتور پنجم
		var $about_arjang_text = 'ارژنگ یک پروژه ی منبع باز (Open Source) خیلی سادست که با زبان php نوشته شده و بیشتر به جنبه ی آموزش برنامه نویسی تکیه دارد تا یک پروژه ی عظیم کاربردی.<p>هدف این پروژه ویرایش متون، از جمله از بین بردن حروف و اعداد عربی و انگلیسی در متن فارسی، حذف برخی واژه ها، تعویض واژه ای به جای واژه ی دیگر و... می باشد.<p>هیچ اطلاعاتی از شما و متونی که وارد می کنید ذخیره نمی شود و پروژه فاقد دیتابیس می باشد.<p>این پروژه توسط www.jentelman.com برنامه نویسی شده است و توسط لینک های زیر می توانید به سورس و اطلاعات بیشتر از پروژه دسترسی داشته باشید. همچنین هر گونه نظر، انتقاد و یا پیشنهاد درباره ی پروژه را از طریق ایمیل me@jentelman.com با من در میان بگذارید.<ul class="selected-style"><li><a href="http://jentelman.com/lab/arjang">* پرونده ی پروژه</a></li><li><a href="http://jentelman.com/laboratory/arjang/arjang-source-jentelman.com.zip">* دانلود سورس پروژه (کدهای پروژه)</a></li><li><a href="http://github.com/javadolmamalek/arjang">* پروژه در github</a></li></ul>'; //متن درباره ی پروژه
		var $editor_textarea_1 = 'متن مورد نظرتان را وارد کنید'; //متن پیش فرض ورودی
		var $editor_textarea_2 = 'محل نمایش خروجی متن...'; //متن پیش فرض خروجی
		var $editor_text_1 = 'عبارت یا جمله مورد نظر جهت حذف'; //متن پیش فرض ورودی عبارت حذفی
		var $editor_text_2 = 'عبارت یا جمله مورد نظر جهت جایگزینی عبارت حذفی'; //متن پیش فرض ورودی عبارت جایگزینی
		var $editor_radio_1 = 'حذف کلی عبارت'; //متن پیش فرض رادیو حذفی اول
		var $editor_radio_2 = 'حذف فقط همین عبارت از لابلای متن'; //متن پیش فرض رادیو حذفی دوم
		var $editor_radio_3 = 'جایگزینی کلی عبارت'; //متن پیش فرض رادیو جایگزینی اول
		var $editor_radio_4 = 'جایگزینی فقط همین عبارت در لابلای متن'; //متن پیش فرض رادیو جایگزینی دوم
		var $editor_radio_5 = 'فاصله یک خط'; //متن پیش فرض رادیو فاصله خطی
		var $editor_radio_6 = 'فاصله یک پاراگراف'; //متن پیش فرض رادیو فاصله پاراگرافی
		var $editor_but = 'ویــرایــش کــن !'; //متن پیش فرض دکمه
		var $err_header_tabs = 'خطا!'; //عنوان هدر خطا
		var $err_system = 'خطایی رخ داده است! لطفن مجدد سعی کنید'; //خطای کلی برنامه نویسی
		var $err_empty_textarea = 'متنی ارسال نشد! لطفن قسمت متن را پر کنید.'; //خطای خالی بودن متن ورودی
		var $err_empty_value_delete = 'عبارتی که می خواهید از متن حذف شود را وارد نکرده اید!'; //خطای خالی بودن عبارت حذفی
		var $err_empty_value_retext = 'عبارتی که می خواهید جایگزین عبارت حذفی شود را ننوشته اید!'; //خطای خالی بودن عبارت جایگزینی
		var $err_ie_brow = 'شما واقعن دارید با همچین مرورگری داخل وب می گردید؟!<br>نمی دانستید مروگر شما خیلی قدیمی و غیر استاندارد است و از بیشتر تکنولوژی های مورد استفاده در سایت های جدید پشتیبانی نمی کند؟<br>لطفن با مرورگری مدرن تر وارد سایت شوید، چون این مرورگر از برخی امکانات سایت پشتیبانی نمی کند و نمی توانید وارد سایت شوید.'; //متن پیغام مرورگر قدیمی
		var $success_header_tabs = 'موفقیت!'; //عنوان هدر موفقیت
		var $success_edit = 'متن شما با موفقیت ویرایش شد. اکنون می توانید از کادر روبروی متن اصلی، متن ویرایش شده را کپی کنید.'; //پیام ویرایش موفقیت آمیز

		/*
		-----------------------------------------------------
		مقادیر ثابت
		-----------------------------------------------------
		*/
		
		var $fvar = array();
		var $error_message;
		var $success_message;
		var $ftext;
		
		/*
		-----------------------------------------------------
		توابع عمومی
		-----------------------------------------------------
		*/
		
		//این تابع بررسی می کند که در حال حاضر کدام یک از ادیتورها انتخاب شده اند.
		public function selected_menu ( $editor_number )
		{
			if( $editor_number == 'editor1' )
			{
				if( isset( $_GET['editor'] ) AND $_GET['editor'] == '1' )
					return true;
				return false;
			}
			elseif( $editor_number == 'editor2' )
			{
				if( isset( $_GET['editor'] ) AND $_GET['editor'] == '2' )
					return true;
				return false;
			}
			elseif( $editor_number == 'editor3' )
			{
				if( isset( $_GET['editor'] ) AND $_GET['editor'] == '3' )
					return true;
				return false;
			}
			elseif( $editor_number == 'editor4' )
			{
				if( isset( $_GET['editor'] ) AND $_GET['editor'] == '4' )
					return true;
				return false;
			}
			elseif( $editor_number == 'editor5' )
			{
				if( isset( $_GET['editor'] ) AND $_GET['editor'] == '5' )
					return true;
				return false;
			}
			else
				return false;
		}
		
		//این تابع مراحل مربوط به ادیتور اول را انجام می دهد و خروجی را می فرستد
		public function edit1 ()
		{
			if( !$this->form_var( $fvar, 'text', 'your-text' ) )
				return false;
			if( empty( $fvar['text'] ) )
				return $this->error_show( $this->err_empty_textarea );
			$english_arabic_array = array("ي","ك","ة","0", "1", "2", "3", "4", "5", "6", "7", "8", "9", "٤", "٥", "٦");
			$persian_array = array("ی","ک","ه","۰", "۱", "۲", "۳", "۴", "۵", "۶", "۷", "۸", "۹", "۴", "۵", "۶");
			$this->ftext = str_replace($english_arabic_array, $persian_array, $fvar['text']);
			return true;
		}
		
		//این تابع مراحل مربوط به ادیتور دوم را انجام می دهد و خروجی را می فرستد
		public function edit2 ()
		{
			if( !$this->form_var( $fvar, 'text', 'your-text' ) )
				return false;
			if( !$this->form_var( $fvar, 'value', 'your-value' ) )
				return false;
			if( !$this->form_var( $fvar, 'action', 'your-action' ) )
				return false;
			if( empty( $fvar['text'] ) )
				return $this->error_show( $this->err_empty_textarea );
			if( empty( $fvar['value'] ) )
				return $this->error_show( $this->err_empty_value_delete );
			if( $fvar['action'] == 'action1' )
			{
				$text = str_replace(' '.$fvar['value'].' ', ' ', $fvar['text']);
				$this->ftext = str_replace($fvar['value'], '', $text);
				return true;
			}
			if( $fvar['action'] == 'action2' )
			{
				$this->ftext = str_replace(' '.$fvar['value'].' ', ' ', $fvar['text']);
				return true;
			}
			return false;
		}
		
		//این تابع مراحل مربوط به ادیتور سوم را انجام می دهد و خروجی را می فرستد
		public function edit3 ()
		{
			if( !$this->form_var( $fvar, 'text', 'your-text' ) )
				return false;
			if( !$this->form_var( $fvar, 'delete', 'your-delete' ) )
				return false;
			if( !$this->form_var( $fvar, 'value', 'your-value' ) )
				return false;
			if( !$this->form_var( $fvar, 'action', 'your-action' ) )
				return false;
			if( empty( $fvar['text'] ) )
				return $this->error_show( $this->err_empty_textarea );
			if( empty( $fvar['delete'] ) )
				return $this->error_show( $this->err_empty_value_delete );
			if( empty( $fvar['value'] ) )
				return $this->error_show( $this->err_empty_value_retext );
			if( $fvar['action'] == 'action1' )
			{
				$this->ftext = str_replace($fvar['delete'], $fvar['value'], $fvar['text']);
				return true;
			}
			if( $fvar['action'] == 'action2' )
			{
				$this->ftext = str_replace(' '.$fvar['delete'].' ', ' '.$fvar['value'].' ', $fvar['text']);
				return true;
			}
			return false;
		}
		
		//این تابع مراحل مربوط به ادیتور چهارم را انجام می دهد و خروجی را می فرستد
		public function edit4 ()
		{
			if( !$this->form_var( $fvar, 'text', 'your-text' ) )
				return false;
			if( !$this->form_var( $fvar, 'action', 'your-action' ) )
				return false;
			if( empty( $fvar['text'] ) )
				return $this->error_show( $this->err_empty_textarea );
			if( $fvar['action'] == 'action1' )
			{
				$this->ftext = preg_replace('#(<br */?>\s*)+#i', '<br />', $fvar['text']);
				return true;
			}
			if( $fvar['action'] == 'action2' )
			{
				$this->ftext = preg_replace('#(<br */?>\s*)+#i', '<br /><br />', $fvar['text']);
				return true;
			}
			return false;
		}
		
		//این تابع مراحل مربوط به ادیتور پنجم را انجام می دهد و خروجی را می فرستد
		public function edit5 ()
		{
			if( !$this->form_var( $fvar, 'text', 'your-text' ) )
				return false;
			if( empty( $fvar['text'] ) )
				return $this->error_show( $this->err_empty_textarea );
			$subtitle = '/[0-9]+<br \/>+[0-9]{2}:[0-9]{2}:[0-9]{2}+,+[0-9]{3} +--&gt;+ [0-9]{2}:[0-9]{2}:[0-9]{2}+,+[0-9]{3}/';
			$this->ftext = preg_replace($subtitle, '', $fvar['text']);
			return true;
		}
		
		/*
		-----------------------------------------------------
		توابع خصوصی
		-----------------------------------------------------
		*/
		
		//این تابع مقادیر ورودی را پس از آنالیز داخل آرایه قرار می دهد
		private function form_var( &$fvar, $arname, $post )
		{
			$fvar[ $arname ] = $this->Sanitize( nl2br( htmlspecialchars( $_POST[ $post ] ) ) );
			return true;
		}
		
		//این تابع پیغام های خطا را می سازد
		private function error_show ( $err )
		{
			$this->error_message .= $err."\r\n";
		}
		
		//این دو تابع اطلاعات ورودی را بررسی می کنند تا از نظر امنیتی مشکلی نداشته باشند
		private function Sanitize( $str,$remove_nl=true )
		{
			$str = $this->StripSlashes( $str );
			if( $remove_nl )
			{
				$injections = array( '/(\n+)/i', '/(\r+)/i', '/(\t+)/i', '/(%0A+)/i', '/(%0D+)/i', '/(%08+)/i', '/(%09+)/i' );
				$str = preg_replace($injections,'',$str);
			}
			return $str;
		}
		private function StripSlashes( $str )
		{
			if( get_magic_quotes_gpc() )
				$str = stripslashes( $str );
			return $str;
		}
	}
?>